Revit 2027 API
PerformanceAdviser.GetAllRuleIds Method
 Retrieves an enumeration of rule Ids.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<PerformanceAdviserRuleId> GetAllRuleIds()
Public Function GetAllRuleIds As IList(Of PerformanceAdviserRuleId)
public:
IList<PerformanceAdviserRuleId^>^ GetAllRuleIds()
member GetAllRuleIds : unit -> IList<PerformanceAdviserRuleId>
Return Value
IList<PerformanceAdviserRuleId>
 A collection of rule Ids
See Also
Reference
PerformanceAdviser Class
Autodesk.Revit.DB Namespace